Repository: rjhllr/inventory-app
Catalog: lib/l10n/app_*.arb
Languages: de

# appTitle
source: Inventory App
de: Inventar-App

# homeTitle
source: Inventory App
de: Inventar-App

source: Start Stock-taking
de: Inventur starten

source: Reset Stocks / Data
de: Bestände / Daten zurücksetzen

source: Stock-taking Settings
de: Inventur-Einstellungen

source: Product Database
de: Produktdatenbank

source: Transaction History
de: Transaktionsverlauf

source: Export CSV
de: CSV exportieren

# exportInventoryData
source: Export inventory data as ZIP file
de: Inventardaten als ZIP-Datei exportieren

source: Scanning
de: Scannen

source: Turn off flash
de: Blitz ausschalten

source: Turn on flash
de: Blitz einschalten

source: Error
de: Fehler

source: Error: {message}
de: Fehler: {message}

source: Prompt for Quantity
de: Nach Anzahl fragen

source: Additional Prompts
de: Zusätzliche Abfragen

source: Add
de: Hinzufügen

source: Edit
de: Bearbeiten

source: Delete
de: Löschen

source: Type
de: Typ

source: Mode
de: Modus

source: Loading...
de: Lädt...

source: Transaction Details
de: Transaktionsdetails

source: Product
de: Produkt

source: Timestamp
de: Zeitstempel

source: This Transaction
de: Diese Transaktion

source: Current Total
de: Aktueller Gesamtwert

source: Set New Total Count:
de: Neue Gesamtanzahl festlegen:

source: Total Count
de: Gesamtanzahl

source: Enter desired total
de: Gewünschte Gesamtanzahl eingeben

source: Set
de: Setzen

source: Attributes
de: Attribute

source: Close
de: Schließen

# totalCountSetTo
source: Total count set to {total} ({difference})
de: Gesamtanzahl auf {total} gesetzt ({difference})

source: Edit Prompt
de: Abfrage bearbeiten

source: Add Prompt
de: Abfrage hinzufügen

source: Save
de: Speichern

source: Label
de: Bezeichnung

# labelHelperText
source: This will be shown to users when prompting for input
de: Dies wird den Benutzern bei der Eingabeaufforderung angezeigt

# pleaseEnterLabel
source: Please enter a label
de: Bitte geben Sie eine Bezeichnung ein

source: Input Type
de: Eingabetyp

# selectInputTypeDescription
source: Select what type of input users will provide:
de: Wählen Sie aus, welche Art von Eingabe Benutzer bereitstellen:

source: Ask Mode
de: Abfragemodus

# chooseAskModeDescription
source: Choose when to ask this question:
de: Wählen Sie, wann diese Frage gestellt werden soll:

source: Prefill last input
de: Letzte Eingabe vorausfüllen

# prefillLastInputDescription
source: Automatically populate with the last entered value
de: Automatisch mit dem zuletzt eingegebenen Wert befüllen

source: Update Prompt
de: Abfrage aktualisieren

# inputTypeNumber
source: Number
de: Zahl

# inputTypePhoto
source: Photo
de: Foto

# inputTypeDate
source: Date
de: Datum

# inputTypeTextDescription
source: Free-form text input
de: Freie Texteingabe

# inputTypeNumberDescription
source: Numeric input only
de: Nur numerische Eingabe

# inputTypePhotoDescription
source: Camera capture
de: Kamera-Aufnahme

# inputTypeDateDescription
source: Date picker
de: Datumsauswahl

# askModeOnce
source: Once per product
de: Einmal pro Produkt

# askModeEveryS
source: Every scan
de: Bei jedem Scan

# askModeOnceDescription
source: Ask only the first time a product is scanned
de: Nur beim ersten Mal fragen, wenn ein Produkt gescannt wird

# askModeEveryScanDescription
source: Ask every time a product is scanned
de: Jedes Mal fragen, wenn ein Produkt gescannt wird

# errorSavingPrompt
source: Error saving prompt: {error}
de: Fehler beim Speichern der Abfrage: {error}

# productPrefix
source: Product: {productCode}
de: Produkt: {productCode}

source: Enter Quantity
de: Menge eingeben

source: Next
de: Weiter

source: Finish
de: Fertig

source: Required
de: Erforderlich

source: Previous
de: Zurück

source: Photo
de: Foto

source: Photo Preview
de: Foto-Vorschau

source: Use Photo
de: Foto verwenden

source: Retake
de: Erneut aufnehmen

source: Failed to load image
de: Bild konnte nicht geladen werden

source: Take Photo
de: Foto aufnehmen

source: Add Another Photo
de: Weiteres Foto hinzufügen

source: Enter text
de: Text eingeben

source: Enter number
de: Zahl eingeben

source: Select date
de: Datum auswählen

# pleaseEnterValue
source: Please enter a value
de: Bitte geben Sie einen Wert ein

source: Export Information
de: Export-Informationen

source: Generate Export
de: Export erstellen

source: Generating export...
de: Export wird erstellt...

source: Export completed successfully!
de: Export erfolgreich abgeschlossen!

# exportFailed
source: Export failed: {error}
de: Export fehlgeschlagen: {error}

# exportDescription
source: The export will generate a ZIP file containing:
de: Der Export erstellt eine ZIP-Datei mit folgendem Inhalt:

# productsCsvDescription
source: Contains all product information including:
de: Enthält alle Produktinformationen einschließlich:

source: Product ID
de: Produkt-ID

source: Created At timestamp
de: Erstellt-am Zeitstempel

source: Updated At timestamp
de: Aktualisiert-am Zeitstempel

# oncePerProductAnswers
source: All "once per product" prompt question answers
de: Alle "einmal pro Produkt" Abfrageantworten

# transactionsCsvDescription
source: Contains all transaction/scan records including:
de: Enthält alle Transaktions-/Scan-Datensätze einschließlich:

source: Transaction ID
de: Transaktions-ID

source: Quantity scanned
de: Gescannte Menge

source: All prompt answers
de: Alle Abfrageantworten

source: images/ folder
de: images/ Ordner

# imagesFolderDescription
source: Contains all photos captured during scanning:
de: Enthält alle beim Scannen aufgenommenen Fotos:

# photosFromPrompts
source: Photos from photo-type prompt questions
de: Fotos von Foto-Typ Abfragen

# filesReferencedInCsv
source: Files referenced in CSV as "images/filename.jpg"
de: Dateien in CSV referenziert als "images/dateiname.jpg"

# originalFilenames
source: Original file names preserved
de: Ursprüngliche Dateinamen erhalten

source: File Naming
de: Datei-Benennung

# exportFilenamePattern
source: Export files are named: inventory_export_YYYYMMDD_HHMMSS.zip
de: Export-Dateien werden benannt: inventory_export_JJJJMMTT_HHMMSS.zip

source: Delete All Data
de: Alle Daten löschen

# actionCannotBeUndone
source: THIS ACTION CANNOT BE UNDONE!
de: DIESE AKTION KANN NICHT RÜCKGÄNGIG GEMACHT WERDEN!

# willPermanentlyDelete
source: This will permanently delete:
de: Dies wird dauerhaft löschen:

source: All scanned products
de: Alle gescannten Produkte

source: All transaction history
de: Alle Transaktionsverläufe

source: All custom prompt questions
de: Alle benutzerdefinierten Abfragen

# absolutelySureToContinue
source: Are you absolutely sure you want to continue?
de: Sind Sie absolut sicher, dass Sie fortfahren möchten?

source: Cancel
de: Abbrechen

# deleteAllCaps
source: DELETE ALL
de: ALLE LÖSCHEN

# allDataPermanentlyDeleted
source: All data has been permanently deleted
de: Alle Daten wurden dauerhaft gelöscht

# failedToDeleteData
source: Failed to delete data: {error}
de: Fehler beim Löschen der Daten: {error}

source: Reset All Stocks
de: Alle Bestände zurücksetzen

# resetAllStocksDescription
source: This will create negative transactions to bring all product stocks to zero. The transaction history will be preserved for audit purposes. Are you sure you want to continue?
de: Dies erstellt negative Transaktionen, um alle Produktbestände auf null zu bringen. Der Transaktionsverlauf wird zu Prüfzwecken aufbewahrt. Sind Sie sicher, dass Sie fortfahren möchten?

source: Reset All
de: Alle zurücksetzen

# allStocksResetToZero
source: All stocks have been reset to zero
de: Alle Bestände wurden auf null zurückgesetzt

source: Reset Product Stock
de: Produktbestand zurücksetzen

# resetProductStockDescription
source: This will create a negative transaction to bring the stock of "{productId}" to zero. The transaction history will be preserved for audit purposes. Are you sure you want to continue?
de: Dies erstellt eine negative Transaktion, um den Bestand von "{productId}" auf null zu bringen. Der Transaktionsverlauf wird zu Prüfzwecken aufbewahrt. Sind Sie sicher, dass Sie fortfahren möchten?

source: Reset
de: Zurücksetzen

# stockResetToZero
source: Stock for "{productId}" has been reset to zero
de: Bestand für "{productId}" wurde auf null zurückgesetzt

source: No transaction history yet
de: Noch kein Transaktionsverlauf

# scanProductToSeeHistory
source: Scan this product to see its transaction history here
de: Scannen Sie dieses Produkt, um seinen Transaktionsverlauf hier zu sehen

source: Stock Summary
de: Bestandsübersicht

source: Current Stock
de: Aktueller Bestand

source: Total Transactions
de: Anzahl der Transaktionen

source: Positive
de: Positiv

source: Negative
de: Negativ

source: File not found
de: Datei nicht gefunden

source: No transactions recorded yet
de: Noch keine Transaktionen aufgezeichnet

# startScanningToSeeHistory
source: Start scanning products to see transaction history
de: Beginnen Sie mit dem Scannen von Produkten, um den Transaktionsverlauf zu sehen

source: Export
de: Exportieren

source: No products scanned yet.
de: Noch keine Produkte gescannt.

# lastUpdated
source: Last updated: {date}
de: Zuletzt aktualisiert: {date}

source: Premium features coming soon
de: Premium-Funktionen kommen bald

source: Failed to save photo
de: Foto konnte nicht gespeichert werden

# cameraError
source: Camera error: {error}
de: Kamera-Fehler: {error}

# errorSavingTransaction
source: Error saving transaction: {error}
de: Fehler beim Speichern der Transaktion: {error}

source: Additions
de: Zugänge

source: Reductions
de: Abgänge

source: Product Information
de: Produktinformationen

# resetAllStocksButton
source: Reset All Stocks
de: Alle Bestände zurücksetzen

source: Reset Individual Stock
de: Einzelnen Bestand zurücksetzen

# deleteAllDataButton
source: Delete All Data
de: Alle Daten löschen

source: Remove All Data
de: Alle Daten entfernen

# permanentDeletionWarning
source: PERMANENT DELETION: This will completely remove all products, transactions, prompt questions, and history. This action cannot be undone.
de: DAUERHAFTES LÖSCHEN: Dies wird alle Produkte, Transaktionen, Abfragen und Verläufe vollständig entfernen. Diese Aktion kann nicht rückgängig gemacht werden.

# removeAllDataButton
source: REMOVE ALL DATA
de: ALLE DATEN ENTFERNEN

source: Stock Reset Information
de: Bestandsrücksetzungs-Informationen

# stockResetExplanation
source: Resetting stocks creates negative transactions that bring each product's stock to zero. This maintains a complete audit trail of all stock movements.
de: Das Zurücksetzen von Beständen erstellt negative Transaktionen, die den Bestand jedes Produkts auf null bringen. Dies gewährleistet eine vollständige Prüfspur aller Bestandsbewegungen.

# allStocksAtZero
source: All stocks are at zero
de: Alle Bestände sind bei null

# noProductsToReset
source: No products currently have stock to reset
de: Derzeit haben keine Produkte Bestand zum Zurücksetzen

source: Reset this product stock
de: Diesen Produktbestand zurücksetzen

# pleaseEnterValidNumber
source: Please enter a valid number
de: Bitte geben Sie eine gültige Zahl ein

source: Product Attributes
de: Produktattribute

source: Photos
de: Fotos

source: Photos ({count})
de: Fotos ({count})

# errorLoadingPhotos
source: Error loading photos: {error}
de: Fehler beim Laden der Fotos: {error}

# transactionHistoryTitle
source: Transaction History
de: Transaktionsverlauf

# errorLoadingTransactionHistory
source: Error loading transaction history: {error}
de: Fehler beim Laden des Transaktionsverlaufs: {error}

source: Retry
de: Wiederholen

# todayAt
source: Today at {time}
de: Heute um {time}

source: Stock addition
de: Bestandsaufstockung

source: Stock reduction
de: Bestandsreduzierung

# productInformationTitle
source: Product Information
de: Produktinformationen

# productIdLabel
source: Product ID: {productId}
de: Produkt-ID: {productId}

# productInfoDescription
source: This screen shows the complete transaction history for this product.
de: Diese Ansicht zeigt den vollständigen Transaktionsverlauf für dieses Produkt.

# positiveQuantitiesInfo
source: • Positive quantities represent stock additions
de: • Positive Mengen repräsentieren Bestandsaufstockungen

# negativeQuantitiesInfo
source: • Negative quantities represent stock reductions or resets
de: • Negative Mengen repräsentieren Bestandsreduzierungen oder Zurücksetzungen

# currentStockInfo
source: • Current stock is the sum of all transactions
de: • Aktueller Bestand ist die Summe aller Transaktionen

# photoViewerTitle
source: Photo {current} of {total}
de: Foto {current} von {total}

source: Photo taken
de: Foto aufgenommen

source: Remove Photo
de: Foto entfernen

source: View Photo
de: Foto ansehen

# transactionsTab
source: Transactions
de: Transaktionen

source: See all
de: Alle anzeigen

# valuesListTitle
source: Values for {attribute}
de: Werte für {attribute}
